# 🌻 ফাইলে থাকা সিকুয়েন্স গুলাকে লিস্ট এ নিয়ে সেটাকে একটা ফাংশনে পাস করসে, সাথে আরেকটা প্যারামিটার পাস করসে bbb=' '...bbb টা আমাদের আল্টিমেট টোটাল কনটিগ টা হবে আর কি।



# 🌻 ফাংশনের ভিতরে ঢুকার পর শুরুতে চেক করবে, list length 0 কি-না। 0 হওয়া মানে লিস্টে আর কিছু নাই। এটা হবে কাজ শেষ হয়ে যাবে যখন। bbb কে রেজাল্ট হিসেবে রিটার্ন করে দিবে

# 🌻 তারপর চেক করসে bbb ভ্যালুটা ফাঁকা কি না। যখন প্রথমবার ফাংশনে ঢুকবে শুধু তখন bbb=' ' থাকবে। কন্ডিশনের ভিতরে ঢুকবে, লিস্টের প্রথম যেই ভ্যালু টা সেটাকে bbb এর ভ্যালু হিসেবে সেট করবে। আবার রিকার্শনের মতো সেইম ফাংশনকে কল করবে। কিন্তু এখন আর bbb এর ভ্যালু ফাঁকা না।


# 🌻 সেকেন্ড বার যখন ফাংশন টা কল হবে তখন bbb এর একটা ভ্যালু আছে। তাই সে else এ ঢুকবে। সেখানে লিস্টের  প্রত্যেকটা সিকুয়েন্স এর জন্য সে চেক করবে ওই সিকুয়েন্স এর শুরুর বা শেষের কোনো পার্ট দিয়ে bbb শুরু বা শেষ হইসে কি-না। মানে কনটিগ যেভাবে খুঁজে আর কি। যদি শুরু বা শেষ হয় তাহলে দুইটা রিড এর কে এড করে নতুন কনটিগ, মানে নতুন bbb এর ভ্যালু দিবে। আর ওই রিড টাকে সিকুয়েন্স লিস্ট থেকে রিমুভ করে দিবে।
#  তারপর নতুন সিকুয়েন্স লিস্ট আর নতুন bbb ভ্যালু দিয়ে আবার ফাংশন রিকার্সিভলি কল হবে।

# 🌻 else এর ভিতরে এভাবে লিস্টের প্রত্যেকটা রিড কে চেক করা হয়।


from Bio import SeqIO
seq_list=[]
f=open("R25.fasta","r")
for record in SeqIO.parse(f,"fasta"):
    seq_list.append(str(record.seq))
def fn(seq_list, bbb=''):
    if (len(seq_list) == 0):
        return bbb

    elif (len(bbb) == 0):
        bbb = seq_list.pop(0)
        return fn(seq_list, bbb)

    else:
        for i in range(len(seq_list)):
            a = seq_list[i]
            for j in range(len(a) // 2):
                c = len(a) - j
                if bbb.startswith(a[j:]):
                    seq_list.pop(i)
                    return fn(seq_list, a[:j] + bbb)
                if bbb.endswith(a[:c]):
                    seq_list.pop(i)
                    return fn(seq_list, bbb + a[c:])
print(fn(seq_list))